:PROPERTIES:
:ID: 6BA720D5-1F2E-475B-ACB0-477F516EA8C9
:END:
#+title: Info
#+description: Info
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:accounts:
#+created: 2026-05-21
#+updated: 2026-05-21

Get all info for an existing account.

#+name: list-account
#+begin_src ores-shell :exports none
accounts info newuser60@acme.com
exit
#+end_src

#+begin_src sh :noweb yes :results output :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<list-account>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
  Tenant: System (ffffffff-ffff-ffff-ffff-ffffffffffff)
ORE Studio Shell REPL v0.0.11
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✗ Account not found: newuser60@acme.com
ores-shell> Bye!
#+end_example
